todo_backend/app/controllers/api/v1/todos_controller.rb

    def create
        @todo = Todo.new(todo_params)

        if @todo.save
---
INSERT INTO "todos" ("title", "completed", "category_id", "created_at", "updated_at") VALUES ('Crear mi primera tarea desde curl', FALSE, 9, '2026-06-09 01:15:04.920192', '2026-06-09 01:15:04.920192') RETURNING "id"

    def update
        @todo = Todo.find(params[:id])

        if @todo.update(todo_params)
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = 7 LIMIT 1
UPDATE "todos" SET "completed" = FALSE, "updated_at" = '2026-06-30 13:49:36.194505' WHERE "todos"."id" = 10